/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec 확장";
"06 06 02 82 06 01 0A 01"		= "Telesec 메커니즘";

"06 07 02 82 06 01 0A 01 00"	= "Telesec 인증";
"06 08 02 82 06 01 0A 01 00 01"	= "암호 인증";
"06 08 02 82 06 01 0A 01 00 02" = "보호된 암호 인증";
"06 08 02 82 06 01 0A 01 00 03" = "한 방향 X.509 인증";
"06 08 02 82 06 01 0A 01 00 04" = "두 방향 X.509 인증";
"06 08 02 82 06 01 0A 01 00 05" = "세 방향 X.509 인증";
"06 08 02 82 06 01 0A 01 00 06" = "한 방향 ISO9798 인증";
"06 08 02 82 06 01 0A 01 00 07" = "두 방향 ISO9798 인증";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom 인증";

"06 07 02 82 06 01 0A 01 01"	= "Telesec 서명";
"06 08 02 82 06 01 0A 01 01 01"	= "RSA 및 ISO9697을 사용하는 MD4";
"06 08 02 82 06 01 0A 01 01 02"	= "RSA 및 Telesec 서명 표준을 사용하는 MD4";
"06 08 02 82 06 01 0A 01 01 03"	= "RSA 및 ISO9697을 사용하는 MD5";
"06 08 02 82 06 01 0A 01 01 04"	= "RSA 및 Telesec 서명 표준을 사용하는 MD5";
"06 08 02 82 06 01 0A 01 01 05"	= "RSA 및 Telekom 서명 표준을 사용하는 RIPEMD-160";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA 서명";

"06 07 02 82 06 01 0A 01 02"	= "Telesec 암호화";
"06 08 02 82 06 01 0A 01 02 00"	= "없음";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "마젠타";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "한 방향 기능";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "블록 암호를 사용하는 해시";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC 기능";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec 모듈";
"06 07 02 82 06 01 0A 02 00"	= "알고리즘";
"06 07 02 82 06 01 0A 02 01"	= "속성 유형";
"06 07 02 82 06 01 0A 02 02"	= "인증서 유형";
"06 07 02 82 06 01 0A 02 03"	= "메시지 유형";
"06 07 02 82 06 01 0A 02 04"	= "PL 프로토콜";
"06 07 02 82 06 01 0A 02 05"	= "SME 및 SME 구성요소";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "유용한 정의";
"06 07 02 82 06 01 0A 02 08"	= "STE 파일";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "전자 주문";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec TTP 비대칭 응용 프로그램";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP 기본 응용 프로그램";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP 메시지";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP 타임 스탬프 응용 프로그램";

"06 06 02 82 06 01 0A 03"		= "대상체 클래스";
"06 07 02 82 06 01 0A 03 00"	= "Telesec 다른 이름";
"06 07 02 82 06 01 0A 03 01"	= "디렉토리";
"06 07 02 82 06 01 0A 03 02"	= "디렉토리 유형";
"06 07 02 82 06 01 0A 03 03"	= "디렉토리 그룹";
"06 07 02 82 06 01 0A 03 04"	= "디렉토리 사용자";
"06 07 02 82 06 01 0A 03 05"	= "대칭 키 엔트리";

"06 06 02 82 06 01 0A 04"		= "패키지";
"06 06 02 82 06 01 0A 05"		= "매개변수";
"06 06 02 82 06 01 0A 06"		= "이름 바인딩";
"06 06 02 82 06 01 0A 07"		= "속성";
"06 07 02 82 06 01 0A 07 00"	= "응용 프로그램 그룹 식별자";
"06 07 02 82 06 01 0A 07 01"	= "인증서 유형";
"06 07 02 82 06 01 0A 07 02"	= "Telesec 인증서";
"06 07 02 82 06 01 0A 07 03"	= "인증서 번호";
"06 07 02 82 06 01 0A 07 04"	= "인증서 해지 목록";
"06 07 02 82 06 01 0A 07 05"	= "생성일";
"06 07 02 82 06 01 0A 07 06"	= "발급자";
"06 07 02 82 06 01 0A 07 07"	= "이름 지정 기관";
"06 07 02 82 06 01 0A 07 08"	= "공개 키 디렉토리";
"06 07 02 82 06 01 0A 07 09"	= "보안 도메인";
"06 07 02 82 06 01 0A 07 0A"	= "주체";
"06 07 02 82 06 01 0A 07 0B"	= "해지 시간";
"06 07 02 82 06 01 0A 07 0C"	= "사용자 그룹 참조";
"06 07 02 82 06 01 0A 07 0D"	= "유효성";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "보안 메시지 환경";
"06 07 02 82 06 01 0A 07 10"	= "익명 공개 키 디렉토리";
"06 07 02 82 06 01 0A 07 11"	= "Telesec 이름";
"06 07 02 82 06 01 0A 07 12"	= "이름 추가";
"06 07 02 82 06 01 0A 07 13"	= "Telesec 우편 번호";
"06 07 02 82 06 01 0A 07 14"	= "이름 구별자";
"06 07 02 82 06 01 0A 07 15"	= "Telesec 인증서 목록";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust 인증서 목록";
"06 07 02 82 06 01 0A 07 17"	= "X.509 인증서 목록";
"06 07 02 82 06 01 0A 07 18"	= "발급일";
"06 07 02 82 06 01 0A 07 19"	= "물리적 카드 번호";
"06 07 02 82 06 01 0A 07 1A"	= "파일 유형";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl 파일은 아카이브입니다.";
"06 07 02 82 06 01 0A 07 1C"	= "이메일 주소";
"06 07 02 82 06 01 0A 07 1D"	= "인증서 템플릿 목록";
"06 07 02 82 06 01 0A 07 1E"	= "디렉토리 이름";
"06 07 02 82 06 01 0A 07 1F"	= "디렉토리 유형 이름";
"06 07 02 82 06 01 0A 07 20"	= "디렉토리 그룹 이름";
"06 07 02 82 06 01 0A 07 21"	= "디렉토리 사용자 이름";
"06 07 02 82 06 01 0A 07 22"	= "해지 플래그";
"06 07 02 82 06 01 0A 07 23"	= "대칭 키 엔트리 이름";
"06 07 02 82 06 01 0A 07 24"	= "GL 번호";
"06 07 02 82 06 01 0A 07 25"	= "GO 번호";
"06 07 02 82 06 01 0A 07 26"	= "G 키 데이터";
"06 07 02 82 06 01 0A 07 27"	= "Z 키 데이터";
"06 07 02 82 06 01 0A 07 28"	= "KT 키 데이터";
"06 07 02 82 06 01 0A 07 2A"	= "KT 키 번호";
"06 07 02 82 06 01 0A 07 33"	= "해지 발생 시간";
"06 07 02 82 06 01 0A 07 34"	= "책임 텍스트";

"06 06 02 82 06 01 0A 08"		= "속성 그룹";
"06 06 02 82 06 01 0A 09"		= "동작";
"06 06 02 82 06 01 0A 0A"		= "알림";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "보안 응용 프로그램";

"06 06 02 82 06 01 0A 0C"		= "인증서 및 CRL 확장 정의";

"06 07 02 82 06 01 0A 0C 00"	= "인증서 확장 책임 제한 확장";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec 인증서 ID 확장";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec 정책 식별자";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec 정책 한정자 ID";
"06 07 02 82 06 01 0A 0C 04"	= "Telesec CRL 필터링된 확장";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec CRL 필터 확장";
"06 07 02 82 06 01 0A 0C 06"	= "Telesec 이름 지정 기관 확장";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "사용자 ID";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822 메일상자";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "도메인 구성요소";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "ABN(오스트레일리아 사업자 등록번호)";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Certificates Australia 정책 식별자";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet 개인";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet 사업";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet 법률";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet 정책 식별자";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "대칭 암호화 알고리즘";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS 높은 보장 정책 식별자";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK 정책 식별자";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT 개인 식별자";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57 모듈";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1 인증서 관리";
"06 06 2A 86 48 CE 38 02"		= "효력 정지 시 수행 명령";
"06 07 2A 86 48 CE 38 02 01"	= "효력 정지 시 수행 명령-없음";
"06 07 2A 86 48 CE 38 02 02"	= "호출 발급자";
"06 07 2A 86 48 CE 38 02 03"	= "거절";
"06 07 2A 86 48 CE 38 02 04"	= "픽업 토큰";
"06 06 2A 86 48 CE 38 03"		= "속성";
"06 06 2A 86 48 CE 38 03 01"	= "부서";
"06 06 2A 86 48 CE 38 03 02"	= "속성 인증서";
"06 06 2A 86 48 CE 38 04"		= "알고리즘";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA 일치";
"06 07 2A 86 48 CE 38 04 03"	= "SHA-1을 사용하는 DSA";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62 필드 유형";
"06 07 2A 86 48 CE 3D 01 01"	= "프라임 필드";
"06 07 2A 86 48 CE 3D 01 02"	= "특성-2 필드";
"06 09 2A 86 48 CE 3D 01 02 03"	= "특성-2 기반";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Null 기반";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "삼항 다항식 기반";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "오항 다항식 기반";
"06 06 2A 86 48 CE 3D 02"		= "공개 키 유형";
"06 07 2A 86 48 CE 3D 02 01"	= "Elliptic 커브 공개 키";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42 필드 유형";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois 필드 프라임";
"06 06 2A 86 48 CE 3E 02"		= "번호 유형";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman 공개 키";
"06 06 2A 86 48 CE 3E 03"		= "체계";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman Static";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman Ephemeral";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman 하이브리드 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman 하이브리드 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Entrust 버전 정보";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "MD5 및 CAST5-CBC를 사용하는 PBE";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "암호 기반 MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Entrust 사용자";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust CA 정보";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "속성 인증서";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA 암호화";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "RSA 암호화를 사용하는 MD2";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "RSA 암호화를 사용하는 MD4";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "RSA 암호화를 사용하는 MD5";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "RSA 암호화를 사용하는 SHA-1";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP 암호화(SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP 암호화";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP 꼬리표 지정됨";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS 서명 체계";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "RSA 암호화를 사용하는 SHA-256";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "RSA 암호화를 사용하는 SHA-384";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "RSA 암호화를 사용하는 SHA-512";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "RSA 암호화를 사용하는 SHA-224";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA 암호화";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman 키 계약";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "MD2 및 DES-CBC를 사용하는 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "MD5 및 DES-CBC를 사용하는 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "MD2 및 RC2-CBC를 사용하는 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "MD5 및 RC2-CBC를 사용하는 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "MD5 및 XOR를 사용하는 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "SHA 및 DES-CBC를 사용하는 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "데이터";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "서명된 데이터";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "봉인된 데이터";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "서명 및 봉인된 데이터";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "다이제스트된 데이터";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "암호화된 데이터";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "속성이 있는 데이터";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "암호화된 개인 키 정보";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "이메일 주소";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "비구성된 이름";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "내용 유형";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "메시지 다이제스트";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "서명 시간";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "부서";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "확인 암호";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "비구성된 주소";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "확장 인증서 속성";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "발급자 및 일련 번호";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "암호 확인";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "공개 키";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "서명 설명";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "확장 요청";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME 기능";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "서명된 데이터 선호";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "암호화 해제할 수 있는 항목 없음";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "수신 알림 요청";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "수신 알림";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "내용 힌트";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "메일 목록 확장 기록";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME 모듈";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "암호화 메시지 구문";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "고급 보안 서비스";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME 대상체 식별자";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3 메시지";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS 전자 서명 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS 전자 서명 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS 전자 서명 정책 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS 전자 서명 정책 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME 내용 유형";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "S/MIME 인증 속성";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME 알고리즘";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME 인증서 배포";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "LDAP 인증서 배포";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME 서명 정책 한정자";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME 서명 유형 식별자";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "발신자 서명";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "도메인 서명";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "추가 속성 서명";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "서명 확인";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME 기능";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "내장된 바이너리 선호";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "친밀한 이름(PKCS-12용)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "로컬 키 ID(PKCS-12용)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "인증서 유형(PKCS-12용)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509 인증서(PKCS-12용)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI 인증서(PKCS-12용)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL 유형(PKCS-12용)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL(PKCS-12용)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 개인 정보 교환 구문";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 암호 기반 암호화 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "SHA-1 및 128비트 RC4를 사용하는 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "SHA-1 및 40비트 RC4를 사용하는 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "SHA-1 및 3키 3중 DES-CBC를 사용하는 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "SHA-1 및 2키 3중 DES-CBC를 사용하는 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "SHA-1 및 128비트 RC2-CBC를 사용하는 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "SHA-1 및 40비트 RC2-CBC를 사용하는 PBE";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 키 보호";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 백 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 키 백 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12 인증서 및 CRL 백 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 보안 백 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 보안 내용 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 보호된 키 백 ID";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12 인증서 백 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509 인증서 및 CRL 백 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 SDSI 인증서 백 ID";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 암호 기반 암호화 ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "SHA-1 및 128비트 RC4를 사용하는 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "SHA-1 및 40비트 RC4를 사용하는 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "SHA-1 및 3중 DES-CBC를 사용하는 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "SHA-1 및 128비트 RC2-CBC를 사용하는 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "SHA-1 및 40비트 RC2-CBC를 사용하는 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "SHA-1 및 RC4를 사용하는 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "SHA-1 및 RC2-CBC를 사용하는 PKCS-12 PBE";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 엔벨롭 ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "128비트 RC4를 사용하는 PKCS-12 RSA 암호화";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "40비트 RC4를 사용하는 PKCS-12 RSA 암호화";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "3중 DES를 사용하는 PKCS-12 RSA 암호화";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12 서명 ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "SHA-1 다이제스트를 사용하는 PKCS-12 RSA 서명";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 버전 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 백 ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 키 백";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 보호된 키 백";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12 인증서 백";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 CRL 백";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 보안 백";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 보안 내용 백";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15 모듈";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15 속성";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15 내용 유형";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15 내용";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI 다이제스트 알고리즘";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "SHA-1을 사용하는 HMAC";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI 암호화 알고리즘";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "MAC을 사용하는 RC4";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC 패드";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus 알 수 없는 정책 식별자";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT 사용자 대 사용자 Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server 대상체 클래스";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "사이트 주소 지정";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "클래스 체계";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "속성 체계";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "메일상자-에이전트";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "메일상자";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "컨테이너";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "메일 수신자";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "배송 메커니즘";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft 파일 포맷";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "SPC 간접 데이터 컨텍스트";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC 에이전시 정보";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC 약관 유형";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC Opus 정보";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC 인증서 확장";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE 이미지 데이터";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC 링크(유형 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "개별 코드 서명";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "상용 코드 서명";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC 링크(유형 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC 최소 기준";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "SPC 재정 기준";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC 링크(유형 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "NTLM 보안 지원 제공업체";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "타임 스탬프 부서";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "인증서 신뢰 목록";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "정렬된 CTL 확장";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "다음 업데이트 위치";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "고급 키 사용";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "인증서 신뢰 목록 서명";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "타임 스탬프 서명";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "직렬화된 암호화";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "암호화된 파일 시스템";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "암호화된 파일 시스템 복구";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Windows 하드웨어 호환 가능";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5 서명";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Windows 하드웨어 OEM 서명";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "내장된 NT 서명";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "신뢰할 수 있는 루트 목록 서명";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "정식 종속";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "키 복구";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "도큐멘트 서명";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "속성 대상체 식별자";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "예/아니요 신뢰 속성";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft 음악 DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM 개인화";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft 라이선스";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft 라이선스 서버";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10 대상체 식별자";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "갱신 인증서";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "등록 이름/값 쌍";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "등록 CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS 버전";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12 속성";
"06 09 2B 06 01 04 01 82 37 11 01"			= "로컬 컴퓨터의 키 세트";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft 등록 인프라";
"06 09 2B 06 01 04 01 82 37 14 01"			= "자동 등록 CTL 사용";
"06 09 2B 06 01 04 01 82 37 14 02"			= "등록 인증서 유형";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "등록 에이전트";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "스마트 카드 로그온";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "NT 주요 이름";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft 인증서 서버 인프라";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA 갱신 버전";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM 버전";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM 속성";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "도큐멘트 이름";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "도큐멘트 설명";
"06 09 2B 06 01 04 01 82 37 58 03"			= "암호화된 데이터";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "암호화된 내용";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT 정책 식별자";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL 정책 식별자";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA 정책 식별자";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "SHA-1을 사용하는 ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "RIPEMD-160을 사용하는 ElGamal";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib 속성";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib 상태 확인";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP 응답 RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP 응답 RTCS 확장";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "CRL 확장 원인";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "키의 기능";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI 부트";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib 내용";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib 구성 데이터";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib 사용자 인덱스";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib 사용자 정보";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY 정책 식별자";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "시간 서명 시스템";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "시간 서명 시스템 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "시간 서명 시스템 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "시간 서명 시스템 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "보조 작업";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "의사 식별자";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos 인증 데이터";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos Diffie-Hellman 키 데이터";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos 응답 키 데이터";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos 클라이언트 인증";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos KDC(Key Distribution Center)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "SPKM(Simple Public Key Mechanism)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "공개 키 인프라";

"06 07 2B 06 01 05 05 07 01"		= "PKIX 개인 인증서 확장";
"06 08 2B 06 01 05 05 07 01 01"		= "인증서 기관 정보 접속";
"06 08 2B 06 01 05 05 07 01 02"		= "생체 인식 정보";
"06 08 2B 06 01 05 05 07 01 03"		= "정식 인증서 약관";
"06 08 2B 06 01 05 05 07 01 04"		= "속성 인증서 검사 ID";
"06 08 2B 06 01 05 05 07 01 05"		= "속성 인증서 대상 설정";
"06 08 2B 06 01 05 05 07 01 06"		= "속성 인증서 기관 관리";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP IP 주소록";
"06 08 2B 06 01 05 05 07 01 08"		= "SBGP 자율 시스템 식별자";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP 라우터 식별자";
"06 08 2B 06 01 05 05 07 01 0A"		= "속성 인증서 프록시";
"06 08 2B 06 01 05 05 07 01 0B"		= "주체 정보 접속";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "정책 한정자 유형";
"06 08 2B 06 01 05 05 07 02 01"		= "인증서 사용 약관";
"06 08 2B 06 01 05 05 07 02 02"		= "사용자 알림";
"06 08 2B 06 01 05 05 07 02 03"		= "텍스트 알림";

"06 07 2B 06 01 05 05 07 03"		= "키의 목적";
"06 08 2B 06 01 05 05 07 03 01"		= "서버 인증";
"06 08 2B 06 01 05 05 07 03 02"		= "클라이언트 인증";
"06 08 2B 06 01 05 05 07 03 03"		= "코드 서명";
"06 08 2B 06 01 05 05 07 03 04"		= "이메일 보호";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC 최종 시스템";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC 터널";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC 사용자";
"06 08 2B 06 01 05 05 07 03 08"		= "타임 스탬프";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP 서명";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA 서버 인증";

"06 07 2B 06 01 05 05 07 04"		= "CMP 정보 유형";
"06 08 2B 06 01 05 05 07 04 01"		= "CA 프로토콜 암호화 인증서";
"06 08 2B 06 01 05 05 07 04 02"		= "서명 키 쌍 유형";
"06 08 2B 06 01 05 05 07 04 03"		= "암호화 키 쌍 유형";
"06 08 2B 06 01 05 05 07 04 04"		= "선호하는 대칭 알고리즘";
"06 08 2B 06 01 05 05 07 04 05"		= "CA 키 업데이트 정보";
"06 08 2B 06 01 05 05 07 04 06"		= "현재 CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "지원되지 않는 OID";
"06 08 2B 06 01 05 05 07 04 08"		= "등록 요청";
"06 08 2B 06 01 05 05 07 04 09"		= "등록 응답";
"06 08 2B 06 01 05 05 07 04 0A"		= "키 쌍 매개변수 요청";
"06 08 2B 06 01 05 05 07 04 0B"		= "키 쌍 매개변수 응답";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF 등록";
"06 08 2B 06 01 05 05 07 05 01"		= "등록 제어";
"06 09 2B 06 01 05 05 07 05 01 01"	= "등록 토큰";
"06 09 2B 06 01 05 05 07 05 01 02"	= "인증자";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI 발행 정보";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI 아카이브 옵션";
"06 09 2B 06 01 05 05 07 05 01 05"	= "이전 인증서 ID";
"06 09 2B 06 01 05 05 07 05 01 06"	= "프로토콜 암호화 키";
"06 09 2B 06 01 05 05 07 05 01 07"	= "대체 인증서 템플릿";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS 템플릿";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF 등록 정보";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 쌍";
"06 09 2B 06 01 05 05 07 05 02 02"	= "인증서 요청";

"06 07 2B 06 01 05 05 07 06"		= "알고리즘";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "서명 없음";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC 조절";

"06 07 2B 06 01 05 05 07 08"		= "다른 이름";
"06 08 2B 06 01 05 05 07 08 01"		= "개인 데이터";
"06 08 2B 06 01 05 05 07 08 02"		= "사용자 그룹";

"06 07 2B 06 01 05 05 07 09"		= "개인 데이터";
"06 08 2B 06 01 05 05 07 09 01"		= "생일";
"06 08 2B 06 01 05 05 07 09 02"		= "출생지";
"06 08 2B 06 01 05 05 07 09 03"		= "가명";
"06 08 2B 06 01 05 05 07 09 04"		= "성별";
"06 08 2B 06 01 05 05 07 09 05"		= "시민권 획득 국가";
"06 08 2B 06 01 05 05 07 09 06"		= "거주 국가";

"06 07 2B 06 01 05 05 07 0A"		= "속성 인증서";
"06 08 2B 06 01 05 05 07 0A 01"		= "인증 정보";
"06 08 2B 06 01 05 05 07 0A 02"		= "접속 ID";
"06 08 2B 06 01 05 05 07 0A 03"		= "과금 ID";
"06 08 2B 06 01 05 05 07 0A 04"		= "그룹";
"06 08 2B 06 01 05 05 07 0A 05"		= "역할";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "온라인 인증서 상태 프로토콜";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP 기본 응답";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP Nonce 확장자";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL 참조";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP 응답";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP 비해지 확인";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP 아카이브 컷오프";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP 서비스 로케이터";

"06 08 2B 06 01 05 05 07 30 02"		= "CA 발급자";
"06 08 2B 06 01 05 05 07 30 03"		= "타임 스탬프";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE 중간";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC 암호화 알고리즘";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC 해시 알고리즘";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC 서명 알고리즘";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2(RSA)";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4(RSA)";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "RSA를 사용하는 MD4";
"06 05 2B 0E 03 02 03"				= "RSA를 사용하는 MD5";
"06 05 2B 0E 03 02 04"				= "RSA 암호화를 사용하는 MD4";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "RSA를 사용하는 SqMod-N";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA 서명";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "SHA를 사용하는 DSA";
"06 05 2B 0E 03 02 0E"				= "RSA 서명을 사용하는 MDC2";
"06 05 2B 0E 03 02 0F"				= "RSA 서명을 사용하는 SHA";
"06 05 2B 0E 03 02 10"				= "일반 모듈러스를 사용하는 Diffie-Hellman";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Common";
"06 05 2B 0E 03 02 15"				= "SHA를 사용하는 DSA Common";
"06 05 2B 0E 03 02 16"				= "RSA 키 전송";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "RSA 서명을 사용하는 MD2";
"06 05 2B 0E 03 02 19"				= "RSA 서명을 사용하는 MD5";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "SHA-1을 사용하는 DSA";
"06 05 2B 0E 03 02 1C"				= "Common SHA-1을 사용하는 DSA";
"06 05 2B 0E 03 02 1D"				= "RSA 암호화를 사용하는 SHA-1";
"06 05 2B 0E 03 03 01"				= "간단하고 강력한 인증 메커니즘";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "RSA를 사용하는 MD2";
"06 06 2B 0E 07 02 03 02"			= "ElGamal를 사용하는 MD2";

/* Teletrust */

"06 03 2B 24 01"					= "도큐멘트";
"06 04 2B 24 01 01"					= "최종 버전";
"06 04 2B 24 01 02"					= "임시";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "알고리즘";
"06 04 2B 24 03 01"					= "암호화 알고리즘";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB 패드";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO 패드";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC 패드";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO 패드";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB 패드";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO 패드";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC 패드";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO 패드";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB 패드";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO 패드";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC 패드";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO 패드";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA 암호화";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB 패드";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC 패드";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM 패드";

"06 04 2B 24 03 02"					= "해시 알고리즘";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 단일 길이";
"06 05 2B 24 03 02 05"				= "MDC2 이중 길이";
"06 04 2B 24 03 03"					= "서명 알고리즘";
"06 05 2B 24 03 03 01"				= "RSA 서명";

"06 06 2B 24 03 03 01 01"			= "SHA-1을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 84 00 02"	= "SHA-1 512/L2를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 85 00 02"	= "SHA-1 640/L2를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 86 00 02"	= "SHA-1 768/L2를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 87 00 02"	= "SHA-1 896/L2를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 88 00 02"	= "SHA-1 1024/L2를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 84 00 03"	= "SHA-1 512/L3을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 85 00 03"	= "SHA-1 640/L3을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 86 00 03"	= "SHA-1 768/L3를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 87 00 03"	= "SHA-1 896/L3을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 88 00 03"	= "SHA-1 1024/L3을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 84 00 05"	= "SHA-1 512/L5를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 85 00 05"	= "SHA-1 640/L5를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 86 00 05"	= "SHA-1 768/L5를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 87 00 05"	= "SHA-1 896/L5를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 88 00 05"	= "SHA-1 1024/L5를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 84 00 09"	= "SHA-1 512/L9를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 85 00 09"	= "SHA-1 640/L9를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 86 00 09"	= "SHA-1 768/L9를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 87 00 09"	= "SHA-1 896/L9를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 88 00 09"	= "SHA-1 1024/L9를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 84 00 11"	= "SHA-1 512/L11를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 85 00 11"	= "SHA-1 640/L11를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 86 00 11"	= "SHA-1 768/L11을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 87 00 11"	= "SHA-1 896/L11을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 01 88 00 11"	= "SHA-1 1024/L11을 사용하는 RSA 서명";

"06 06 2B 24 03 03 01 02"			= "RIPEMD-160을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 84 00 02"	= "RIPEMD-160 512/L2를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 85 00 02"	= "RIPEMD-160 640/L2를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 86 00 02"	= "RIPEMD-160 768/L2를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 87 00 02"	= "RIPEMD-160 896/L2를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 88 00 02"	= "RIPEMD-160 1024/L2을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 84 00 03"	= "RIPEMD-160 512/L3을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 85 00 03"	= "RIPEMD-160 640/L3을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 86 00 03"	= "RIPEMD-160 768/L3을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 87 00 03"	= "RIPEMD-160 896/L3를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 88 00 03"	= "RIPEMD-160 1024/L3을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 84 00 05"	= "RIPEMD-160 512/L5를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 85 00 05"	= "RIPEMD-160 640/L5를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RIPEMD-160 768/L5를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RIPEMD-160 896/L5를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 88 00 05"	= "RIPEMD-160 1024/L5을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 84 00 09"	= "RIPEMD-160 512/L9를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 85 00 09"	= "RIPEMD-160 640/L9를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 86 00 09"	= "RIPEMD-160 768/L9를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 87 00 09"	= "RIPEMD-160 896/L9를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 88 00 09"	= "RIPEMD-160 1024/L9를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 84 00 11"	= "RIPEMD-160 512/L11를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 85 00 11"	= "RIPEMD-160 640/L11을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 86 00 11"	= "RIPEMD-160 768/L11를 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 87 00 11"	= "RIPEMD-160 896/L11을 사용하는 RSA 서명";
"06 09 2B 24 03 03 01 02 88 00 11"	= "RIPEMD-160 1024/L11을 사용하는 RSA 서명";

"06 06 2B 24 03 03 01 03"			= "RIPEMD-128을 사용하는 RSA 서명";
"06 06 2B 24 03 03 01 04"			= "RIPEMD-256를 사용하는 RSA 서명";

"06 05 2B 24 03 03 02"				= "ECSIE 서명";
"06 06 2B 24 03 03 02 01"			= "SHA-1을 사용하는 ECSIE 서명";
"06 06 2B 24 03 03 02 02"			= "RIPEMD-160을 사용하는 ECSIE 서명";
"06 06 2B 24 03 03 02 03"			= "MD2를 사용하는 ECSIE 서명";
"06 06 2B 24 03 03 02 04"			= "MD5를 사용하는 ECSIE 서명";

"06 04 2B 24 03 04"					= "서명 체계";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "RED를 사용하는 ISO9796-2";
"06 06 2B 24 03 04 02 02"			= "RSA를 사용하는 ISO9796-2";
"06 06 2B 24 03 04 02 03"			= "RND을 사용하는 ISO9796-2";

"06 03 2B 24 04"					= "속성";
"06 03 2B 24 05"					= "정책";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "제조업체별 API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "기능별 API";
"06 03 2B 24 07"					= "키 관리";
"06 04 2B 24 07 01"					= "키 계약";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "키 전송";
"06 05 2B 24 07 02 01"				= "RSA 암호를 사용하는 ISO9796-2";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform 정책 식별자";
"06 05 2B 24 08 02 01"				= "디렉토리 서비스";

"06 05 2B 24 08 03 01"				= "인증서 발행일";
"06 05 2B 24 08 03 02"				= "입수";
"06 05 2B 24 08 03 03"				= "허가";
"06 05 2B 24 08 03 04"				= "금전상의 제한";
"06 05 2B 24 08 03 05"				= "대다수의 선언";
"06 05 2B 24 08 03 06"				= "통합 회로 카드 일련 번호";
"06 05 2B 24 08 03 07"				= "공개 키 참조";
"06 05 2B 24 08 03 08"				= "제한";
"06 05 2B 24 08 03 09"				= "허가되면 가져오기";
"06 05 2B 24 08 03 0A"				= "요청된 인증서";
"06 05 2B 24 08 03 0B"				= "이름 지정 기관";
"06 05 2B 24 08 03 0C"				= "다음의 디렉토리 내에 있는 인증서";
"06 05 2B 24 08 03 0D"				= "인증서 해시";

"06 05 2B 24 08 04 01"				= "개인 데이터";
"06 05 2B 24 08 04 08"				= "제한";
"06 07 2B 24 08 05 01 01 01"		= "RSA 표시 SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA 표시 RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "SHA-1를 사용하는 RSA";
"06 07 2B 24 08 05 01 01 04"		= "RIPEMD-160을 사용하는 RSA";
"06 07 2B 24 08 05 01 02 01"		= "DSA 확장";
"06 07 2B 24 08 05 01 02 02"		= "RIPEMD-160을 사용하는 DSA";

"06 05 2B 24 08 06 01"				= "인증서";
"06 05 2B 24 08 06 02"				= "인증서 참조";
"06 05 2B 24 08 06 03"				= "속성 인증서";
"06 05 2B 24 08 06 04"				= "속성 참조";
"06 05 2B 24 08 06 05"				= "파일 이름";
"06 05 2B 24 08 06 06"				= "저장 시간";
"06 05 2B 24 08 06 07"				= "파일 크기";
"06 05 2B 24 08 06 08"				= "위치";
"06 05 2B 24 08 06 09"				= "서명 번호";
"06 05 2B 24 08 06 0A"				= "자동 생성";

"06 05 2B 24 08 07 01"				= "Teletrust 프레젠테이션 유형";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "바이너리";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "텍스트";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte 인증서 확장";
"06 05 2B 65 01 04 01"				= "강력한 엑스트라넷";

/* X.520 */

"06 02 55 04"		= "X.520 속성 유형";
"06 03 55 04 00"	= "대상체 클래스";
"06 03 55 04 01"	= "엔트리의 가명";
"06 03 55 04 02"	= "지식 정보";
"06 03 55 04 03"	= "일반 이름";
"06 03 55 04 04"	= "성";
"06 03 55 04 05"	= "일련 번호";
"06 03 55 04 06"	= "국가 이름";
"06 03 55 04 07"	= "로컬 이름";
"06 04 55 04 07 01"	= "공동 지역 이름";
"06 03 55 04 08"	= "도 이름";
"06 04 55 04 08 01"	= "공동 도 이름";
"06 03 55 04 09"	= "주소";
"06 04 55 04 09 01"	= "공동 주소";
"06 03 55 04 0A"	= "조직명";
"06 04 55 04 0A 01"	= "공동 조직명";
"06 03 55 04 0B"	= "조직 부서명";
"06 04 55 04 0B 01"	= "공동 부서명";
"06 03 55 04 0C"	= "제목";
"06 03 55 04 0D"	= "설명";
"06 03 55 04 0E"	= "검색 안내";
"06 03 55 04 0F"	= "업종";
"06 03 55 04 10"	= "우편 주소";
"06 04 55 04 10 01"	= "공동 우편 주소";
"06 03 55 04 11"	= "우편 번호";
"06 04 55 04 11 01"	= "공동 우편 번호";
"06 03 55 04 12"	= "사서함";
"06 04 55 04 12 01"	= "공동 사서함";
"06 03 55 04 13"	= "우편 취급소 이름";
"06 04 55 04 13 01"	= "공동 우편 취급소 이름";
"06 03 55 04 14"	= "전화 번호";
"06 04 55 04 14 01"	= "공동 전화 번호";
"06 03 55 04 15"	= "텔렉스 번호";
"06 04 55 04 15 01"	= "공동 텔렉스 번호";
"06 03 55 04 16"	= "텔렉스 터미널 식별자";
"06 04 55 04 16 01"	= "공동 텔렉스 터미널 식별자";
"06 03 55 04 17"	= "팩스 번호";
"06 04 55 04 17 01"	= "공동 팩스 번호";
"06 03 55 04 18"	= "X.121 주소";
"06 03 55 04 19"	= "국제 ISDN 번호";
"06 04 55 04 19 01"	= "공동 국제 ISDN 번호";
"06 03 55 04 1A"	= "등록 주소";
"06 03 55 04 1B"	= "대상 표시자";
"06 03 55 04 1C"	= "선호하는 배송 방법";
"06 03 55 04 1D"	= "제출 주소";
"06 03 55 04 1E"	= "지원되는 응용 프로그램 컨텍스트";
"06 03 55 04 1F"	= "회원";
"06 03 55 04 20"	= "소유자";
"06 03 55 04 21"	= "역할 구성원";
"06 03 55 04 22"	= "추가 정보";
"06 03 55 04 23"	= "사용자 암호";
"06 03 55 04 24"	= "사용자 인증서";
"06 03 55 04 25"	= "CA 인증서";
"06 03 55 04 26"	= "기관 해지 목록";
"06 03 55 04 27"	= "인증서 해지 목록";
"06 03 55 04 28"	= "교차 인증서 쌍";
"06 03 55 04 29"	= "이름";
"06 03 55 04 2A"	= "이름";
"06 03 55 04 2B"	= "이니셜";
"06 03 55 04 2C"	= "세대 식별";
"06 03 55 04 2D"	= "고유 식별자";
"06 03 55 04 2E"	= "DN 한정자";
"06 03 55 04 2F"	= "고급 검색 안내";
"06 03 55 04 30"	= "프로토콜 정보";
"06 03 55 04 31"	= "고유 이름";
"06 03 55 04 32"	= "고유 회원";
"06 03 55 04 33"	= "집 식별자";
"06 03 55 04 34"	= "지원되는 알고리즘";
"06 03 55 04 35"	= "델타 해지 목록";
"06 03 55 04 36"	= "허가";
"06 03 55 04 3A"	= "교차 인증서 쌍";

/* X.500 object classes */

"06 02 55 06"		= "X.520 대상체 클래스";
"06 03 55 06 00"	= "위";
"06 03 55 06 01"	= "가상본";
"06 03 55 06 02"	= "국가";
"06 03 55 06 03"	= "로컬";
"06 03 55 06 04"	= "조직";
"06 03 55 06 05"	= "조직 부서";
"06 03 55 06 06"	= "개인";
"06 03 55 06 07"	= "조직원";
"06 03 55 06 08"	= "조직 역할";
"06 03 55 06 09"	= "이름 그룹";
"06 03 55 06 0A"	= "거주자";
"06 03 55 06 0B"	= "응용 프로그램 프로세스";
"06 03 55 06 0C"	= "응용 프로그램 개체";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "장비";
"06 03 55 06 0F"	= "강력한 인증 사용자";
"06 03 55 06 10"	= "인증서 기관";
"06 03 55 06 11"	= "고유 이름 그룹";
"06 03 55 06 15"	= "PKI 사용자";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "X.500 알고리즘";
"06 03 55 08 01"	= "X.500 암호화 알고리즘";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509 인증서 확장";
"06 03 55 1D 01"	= "기관 키 식별자(이전)";
"06 03 55 1D 02"	= "기본 키 속성(이전)";
"06 03 55 1D 03"	= "인증서 정책(이전)";
"06 03 55 1D 04"	= "키 사용 제한(이전)";
"06 03 55 1D 05"	= "정책 매핑(이전)";
"06 03 55 1D 06"	= "서브 트리 제약 조건";
"06 03 55 1D 07"	= "주체 대체 이름(이전)";
"06 03 55 1D 08"	= "발급자 대체 이름(이전)";
"06 03 55 1D 09"	= "주체 디렉토리 속성";
"06 03 55 1D 0A"	= "기본 제약 조건(이전 2.5.29.10)";
"06 03 55 1D 0B"	= "이름 제약 조건(이전)";
"06 03 55 1D 0C"	= "정책 제약 조건(이전)";
"06 03 55 1D 0D"	= "기본 제약 조건(이전 2.5.29.13)";
"06 03 55 1D 0E"	= "주체 키 식별자";
"06 03 55 1D 0F"	= "키 사용";
"06 03 55 1D 10"	= "개인 키 사용 기간";
"06 03 55 1D 11"	= "주체 대체 이름";
"06 03 55 1D 12"	= "발급자 대체 이름";
"06 03 55 1D 13"	= "기본 제약 조건";
"06 03 55 1D 14"	= "인증서 해지 목록 번호";
"06 03 55 1D 15"	= "CRL 원인 코드";
"06 03 55 1D 16"	= "만료일(이전)";
"06 03 55 1D 17"	= "효력 정지 시 수행 명령 코드";
"06 03 55 1D 18"	= "효력 정지 날짜";
"06 03 55 1D 19"	= "CRL 배포 지점(이전)";
"06 03 55 1D 1A"	= "발급 배포 지점(이전)";
"06 03 55 1D 1B"	= "델타 CRL 표시자";
"06 03 55 1D 1C"	= "발급 배포 지점";
"06 03 55 1D 1D"	= "인증서 발급자";
"06 03 55 1D 1E"	= "이름 제약 조건";
"06 03 55 1D 1F"	= "CRL 배포 지점";
"06 03 55 1D 20"	= "인증서 정책";
"06 04 55 1D 20 00"	= "모든 정책 식별자";
"06 03 55 1D 21"	= "정책 매핑";
"06 03 55 1D 22"	= "정책 제약 조건";
"06 03 55 1D 23"	= "기관 키 식별자";
"06 03 55 1D 24"	= "정책 제약 조건";
"06 03 55 1D 25"	= "확장 키 사용";
"06 04 55 1D 25 00"	= "모든 확장된 키 사용";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS 서명 알고리즘";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza 서명 알고리즘";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS 기밀성 알고리즘";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza 기밀성 알고리즘";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS 무결성 알고리즘";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza 무결성 알고리즘";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS 토큰 보호 알고리즘";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza 토큰 보호 알고리즘";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS 키 관리 알고리즘";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza 키 관리 알고리즘";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS 키 관리 및 서명 알고리즘";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza 키 관리 및 서명 알고리즘";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A 서명 알고리즘";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A 기밀성 알고리즘";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A 무결성 알고리즘";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A 토큰 보호 알고리즘";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A 키 관리 알고리즘";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A 키 관리 및 서명 알고리즘";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza 업데이트된 서명 알고리즘";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza 키 관리 및 업데이트된 서명 알고리즘";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza 업데이트된 무결성 알고리즘";
"06 09 60 86 48 01 65 02 01 01 16"	= "키 교환 알고리즘";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80 알고리즘";
"06 09 60 86 48 01 65 02 01 01 18"	= "KEA(키 암호화 알고리즘)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822 메시지 포맷";
"06 09 60 86 48 01 65 02 01 02 02"	= "빈 내용";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP 내용 유형";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3 내용 유형";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP 내용 유형";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey 에이전트 프로토콜";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1 내용 유형";
"06 09 60 86 48 01 65 02 01 02 48"	= "전달된 MSP 메시지 분문";
"06 09 60 86 48 01 65 02 01 02 49"	= "MSP 전달된 메시지 매개변수";
"06 09 60 86 48 01 65 02 01 02 50"	= "전달된 CSP 메시지 본문";
"06 09 60 86 48 01 65 02 01 02 51"	= "CSP 전달된 메시지 매개변수";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS 보안 정책";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "보안 정책";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "일반";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "기본 보안 정책";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS 키 관리 인증서";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS 사용자 서명 인증서";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS 키 관리 및 서명 인증서";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza 키 관리 인증서";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza 키 관리 및 서명 인증서";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza 사용자 서명 인증서";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza CA 서명 인증서";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS CA 서명 인증서";
"06 09 60 86 48 01 65 02 01 05 0A"	= "보조 벡터";
"06 09 60 86 48 01 65 02 01 05 0B"	= "수신 알림 정책";
"06 09 60 86 48 01 65 02 01 05 0C"	= "회원 권한";
"06 09 60 86 48 01 65 02 01 05 0D"	= "관리자";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "메타 SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "메타 SDNS 서명 CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS 서명 CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "SDNS 인증서 해지 목록";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Fortezza 인증서 해지 목록";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "제외된 주소 프로세서";
"06 09 60 86 48 01 65 02 01 05 30"	= "보호";
"06 09 60 86 48 01 65 02 01 05 31"	= "알고리즘 지원";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A 키 관리 인증서";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A 키 관리 및 서명 인증서";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A 사용자 서명 인증서";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC 정보";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC CA 제약 조건";
"06 09 60 86 48 01 65 02 01 05 37"	= "서명 또는 키 관리 권한";
"06 09 60 86 48 01 65 02 01 05 38"	= "공통 권한";
"06 09 60 86 48 01 65 02 01 05 39"	= "꼬리표로 표시된 속성";
"06 09 60 86 48 01 65 02 01 05 3A"	= "정책 정보 파일";
"06 09 60 86 48 01 65 02 01 05 3B"	= "보안 정책 정보 파일";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA 허가 제약 조건";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP 확장";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI 보안 카테고리";
"06 09 60 86 48 01 65 02 01 08 02"		= "표준 보안 꼬리표 권한";

"06 09 60 86 48 01 65 02 01 0A 01"			= "서명 권한";
"06 09 60 86 48 01 65 02 01 0A 02"			= "키 관리 권한";
"06 09 60 86 48 01 65 02 01 0A 03"			= "이름을 가진 태그 세트 권한";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK 데모";
"06 09 60 86 48 01 65 02 01 0B 02"			= "미국 국방부 클래스 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "미국 중간 단계 파일럿";
"06 09 60 86 48 01 65 02 01 0B 04"			= "미국 국방부 클래스 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "미국 국방부 클래스 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "미국 국방부 클래스 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "미국 국방부 PKI 클래스 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "테스트 보안 정책";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 태그 세트 0";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 태그 세트 1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 태그 세트 2";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2 보안 카테고리";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 태그 세트 0";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 태그 세트 1";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 태그 세트 2";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka 보안 카테고리";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka 태그 세트 이름 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka 태그 세트 이름 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka 태그 세트 이름 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "테스트 CRL 엔트리";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "꼬리표";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK 정책 식별자";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA 기초 정책 식별자";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA 기본 정책 식별자";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA 중급 정책 식별자";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA 고급 정책 식별자";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA 키";
"06 08 60 86 48 01 65 03 02 03"			= "확장";
"06 09 60 86 48 01 65 03 02 03 01"		= "키 복구 기술";
"06 09 60 86 48 01 65 03 02 03 02"		= "키 복구 가능";
"06 09 60 86 48 01 65 03 02 03 03"		= "키 복구";
"06 08 60 86 48 01 65 03 02 04"			= "키 복구 체계";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK 확장";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST 알고리즘";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell 알고리즘";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC 패드 IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC 패드 IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC 패드 IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC 패드";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "RSA 암호화 BSAFE1을 사용하는 MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "RSA 암호화 BSAFE1을 사용하는 MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "RSA 암호화 BSAFE1를 사용하는 SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM 다이제스트";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "SHA1-RSA를 사용하는 IKE HMAC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "MD5-RSA를 사용하는 IKE HMAC ";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC 패드";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4 패킷";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA 암호화 BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW 암호";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI 속성 유형";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "보안 속성";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "신용 제한";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape 대상체 식별자";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape 인증서 확장";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape 인증서 유형";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape 기본 URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape 해지 URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA 해지 URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL 다운로드 URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA 인증서 다운로드 URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape 인증서 갱신 URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA 정책 URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "Netscape 인증서 홈페이지 URL";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape 인증서 엔트리 로고";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Netscape 인증서 사용자 사진";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape SSL 서버 이름";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape 인증서 주석";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape 데이터 유형";
"06 09 60 86 48 01 86 F8 42 02 01"	= "image/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "image/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape 인증서 순서";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape 인증서 URL";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape 디렉토리 대상체 식별자";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP 정의";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "차량 번호";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "부서 번호";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "사원 번호";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "사원 유형";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "인트라넷 구성원";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "알 수 없는 Verisign VPN 확장";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "알 수 없는 Verisign VPN 확장";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign 정책 식별자";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1 알림";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "내용 유형";
"06 04 67 2A 00 00"	= "PAN 데이터";
"06 04 67 2A 00 01"	= "PAN 토큰";
"06 04 67 2A 00 02"	= "PAN 전용";

"06 03 67 2A 01"	= "메시지 확장";
"06 03 67 2A 02"	= "필드";
"06 04 67 2A 02 00"	= "전체 이름";
"06 04 67 2A 02 01"	= "이름";
"06 04 67 2A 02 02"	= "성";
"06 04 67 2A 02 03"	= "성";
"06 04 67 2A 02 04"	= "지역 이름";
"06 04 67 2A 02 05"	= "ID";
"06 04 67 2A 02 06"	= "월";
"06 04 67 2A 02 07"	= "날짜";
"06 04 67 2A 02 08"	= "주소";
"06 04 67 2A 02 09"	= "전화";
"06 04 67 2A 02 0A"	= "양";
"06 04 67 2A 02 0B"	= "계정 번호";
"06 04 67 2A 02 0C"	= "암호";

"06 03 67 2A 03"		= "속성";
"06 04 67 2A 03 00"		= "인증서";
"06 05 67 2A 03 00 00"	= "루트 키 지문";
"06 05 67 2A 03 00 01"	= "추가 정책";

"06 03 67 2A 04"	= "알고리즘";
"06 03 67 2A 05"	= "정책";
"06 04 67 2A 05 00"	= "루트";
"06 03 67 2A 06"	= "모듈";
"06 03 67 2A 07"	= "인증서 확장";
"06 04 67 2A 07 00"	= "해시된 루트 키";
"06 04 67 2A 07 01"	= "인증서 유형";
"06 04 67 2A 07 02"	= "상용 데이터";
"06 04 67 2A 07 03"	= "카드 인증서 필요";
"06 04 67 2A 07 04"	= "터널링";
"06 04 67 2A 07 05"	= "SET 확장";
"06 04 67 2A 07 06"	= "SET 한정자";

"06 03 67 2A 08"	= "브랜드";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "공급업체";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "국내";
"06 05 67 2A 0A E2 00"	= "일본";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "해시된 루트 키";
"06 04 86 8D 6F 03"	= "인증서 유형";
"06 04 86 8D 6F 04"	= "상용 데이터";
"06 04 86 8D 6F 05"	= "카드 인증서 필요";
"06 04 86 8D 6F 06"	= "터널링";
"06 04 86 8D 6F 07"	= "SET 한정자";
"06 04 86 8D 6F 63"	= "SET 데이터";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple 데이터 보안";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple 신뢰 정책 식별자";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign 정책";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple X.509 기본 정책";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple SSL 정책";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple 로컬 인증서 발행 정책";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple 로컬 CSR 발행 정책";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple CRL 해지 정책";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple OCSP 해지 정책";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple S/MIME 정책";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple 확장 가능한 인증 정책";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apple 소프트웨어 업데이트 서명 정책";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPsec 정책";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat 정책";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apple 리소스 서명 정책";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apple Kerberos 클라이언트 정책";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apple Kerberos 서버 정책";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apple 코드 서명 정책";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apple 패키지 서명 정책";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple 보안 알고리즘 식별자";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "FEE(Fast Elliptic Encryption)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "ASC(Apple Secure Compression)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "MD5 서명을 사용하는 FEE";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "SHA-1 서명을 사용하는 FEE";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED 암호화";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED(시험용)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "ECDSA 서명을 사용하는 FEE";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac 인증서 식별자";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac 인증서 요청";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac ID 인증서 요청";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac 이메일 서명 인증서 요청";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac 이메일 암호화 인증서 요청";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac 아카이브 목록 요청";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac 아카이브 저장소 요청";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac 아카이브 가져오기 요청";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac 아카이브 제거 요청";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac 인증서 확장 영역";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac ID";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac 이메일 서명";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac 이메일 암호화";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac 인증서 요청 값";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "사용자 이름";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "암호";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "호스트 이름";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "갱신 플래그";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "비동기 플래그";

"06 08 2A 86 48 86 F7 63 64 04" = "Apple 확장 키 사용";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple 코드 서명";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple 코드 서명(개발)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apple 소프트웨어 업데이트 서명";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple 코드 서명(예약됨)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple 리소스 서명";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat 서명";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat 암호화";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple 시스템 ID";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple 인증서 정책";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apple 인증서 정책";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac 인증서 정책";

/* Extended key usage */

"06 04 55 1D 25 03"					= "코드 서명";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA 보안";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA 보안 포맷";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3 인증서 확장";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "X.509v3 개인 인증서 확장";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "주체 서명 비트맵";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "주체 그림";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "주체의 이메일 주소";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "사용 면제";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA 보안 알고리즘";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "ECDSA를 사용하는 SHA-1";

/* end */
